const id = "why-i-built-this-blog.md";
						const collection = "posts";
						const slug = "why-i-built-this-blog";
						const body = "\n在这个短视频只需 15 秒就能获得一次多巴胺反馈的时代，在这个 AI 一秒钟就能生成千字长文的时代，我却选择花好几个周末，一行一行代码地敲出了这个博客网站。\n\n有人问我：“为什么不直接用现成的平台？知乎、掘金、公众号，哪个不比自己建站方便？哪个不比自己建站流量大？”\n\n是啊，为什么呢？\n\n## 为了对抗遗忘\n\n人的记忆是不可靠的。\n\n那些灵光一闪的瞬间，那些解决掉棘手 Bug 后的狂喜，那些深夜里对未来的迷茫与思考，如果不用文字记录下来，很快就会被时间的洪流冲刷得无影无踪。\n\n我不想当我老了，回首往事时，只记得 endless 的需求和改不完的 Bug。我想看到自己成长的轨迹，看到那个曾经笨拙但努力的自己。这个博客，就是我数字生命的时间胶囊。\n\n## 为了拥有一片自留地\n\n平台是别人的，规则是别人定的。\n\n你不知道哪一天，你的文章会被莫名其妙地限流；你不知道哪一天，你辛辛苦苦积累的粉丝会因为平台的一个改版而流失；你甚至不知道哪一天，这个平台本身会不会消失。\n\n但在我的博客里，我是唯一的国王。\n\n我可以自由地决定它的样子，是深邃的黑还是明亮的白；我可以自由地决定写什么，是硬核的技术干货，还是无病呻吟的碎碎念。这里没有算法推荐，没有广告弹窗，只有我和我的文字，静静地等待着有缘人的到来。\n\n这种掌控感，是任何第三方平台都给不了的自由。\n\n## 为了连接\n\n“孤岛”并不是为了封闭，而是为了更深层的连接。\n\n在这个快节奏的互联网世界，我们习惯了点赞之交，习惯了滑过即阅。但我相信，总有一些人，愿意慢下来，愿意读完一篇长文，愿意透过文字去触碰另一个灵魂。\n\n哪怕只有一个人，因为我的文章解决了困扰许久的问题；哪怕只有一个人，因为我的文字产生了一丝共鸣，觉得“原来我不是一个人在战斗”。\n\n那么，这一切就都是值得的。\n\n## 结语\n\n搭建这个博客，就像是在数字荒原上种下了一棵树。\n\n它可能不会长成参天大树，也可能不会引来万众瞩目。但它就在那里，扎根于我的思考，生长于我的热爱。\n\n它证明了，在这个喧嚣的世界里，我依然保留着一份对表达的执着，和对生活的热忱。\n\n这，就是我制作这个博客网站的理由。\n";
						const data = {title:"为什么我要制作这个博客网站",description:"在这个算法推荐横行的时代，我为什么要费力气去搭建一个属于自己的“孤岛”？这是一次关于初心、自由与连接的内心独白。",publishedAt:new Date(1766152800000),tags:[],category:"essay",isPinned:false,draft:false};
						const _internal = {
							type: 'content',
							filePath: "C:/Code/X_blog/src/content/posts/why-i-built-this-blog.md",
							rawData: undefined,
						};

export { _internal, body, collection, data, id, slug };
